; domain
(define (domain blocksworld)
(:predicates (clear ?x)
             (ontable ?x)
             (on ?x ?y))

(:action move-b-to-b
  :parameters (?bm ?bf ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (on ?bm ?bf))
  :effect (and (not (clear ?bt)) (not (on ?bm ?bf))
               (on ?bm ?bt) (clear ?bf)))

(:action move-b-to-t
  :parameters (?bm ?bf)
  :precondition (and (clear ?bm) (on ?bm ?bf))
  :effect (and (not (on ?bm ?bf))
               (ontable ?bm) (clear ?bf)))

(:action move-t-to-b
  :parameters (?bm ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (ontable ?bm))
  :effect (and (not (clear ?bt)) (not (ontable ?bm))
               (on ?bm ?bt))))

; problem
(define (problem BW-rand-11)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 )
(:init
(on b1 b2)
(ontable b2)
(ontable b3)
(on b4 b3)
(on b5 b11)
(on b6 b5)
(on b7 b4)
(on b8 b1)
(on b9 b6)
(ontable b10)
(ontable b11)
(clear b7)
(clear b8)
(clear b9)
(clear b10)
)
(:goal
(and
(on b5 b11)
(on b6 b2)
(on b8 b1)
(on b9 b3)
(on b10 b6)
(on b11 b7))
)
)

; plan
1. (move-b-to-t b7 b4)
   deleted: (on b7 b4)
   added: (ontable b7) (clear b4)
   goals met: 2 of 6
2. (move-b-to-t b4 b3)
   deleted: (on b4 b3)
   added: (ontable b4) (clear b3)
   goals met: 2 of 6
3. (move-b-to-b b9 b6 b3)
   deleted: (clear b3) (on b9 b6)
   added: (on b9 b3) (clear b6)
   goals met: 3 of 6
4. (move-b-to-b b8 b1 b10)
   deleted: (clear b10) (on b8 b1)
   added: (on b8 b10) (clear b1)
   goals met: 2 of 6
5. (move-b-to-b b1 b2 b4)
   deleted: (clear b4) (on b1 b2)
   added: (on b1 b4) (clear b2)
   goals met: 2 of 6
6. (move-b-to-b b6 b5 b2)
   deleted: (clear b2) (on b6 b5)
   added: (on b6 b2) (clear b5)
   goals met: 3 of 6
7. (move-b-to-b b5 b11 b1)
   deleted: (clear b1) (on b5 b11)
   added: (on b5 b1) (clear b11)
   goals met: 2 of 6
8. (move-t-to-b b11 b7)
   deleted: (clear b7) (ontable b11)
   added: (on b11 b7)
   goals met: 3 of 6
9. (move-b-to-b b5 b1 b11)
   deleted: (clear b11) (on b5 b1)
   added: (on b5 b11) (clear b1)
   goals met: 4 of 6
10. (move-b-to-b b8 b10 b1)
   deleted: (clear b1) (on b8 b10)
   added: (on b8 b1) (clear b10)
   goals met: 5 of 6
11. (move-t-to-b b10 b6)
   deleted: (clear b6) (ontable b10)
   added: (on b10 b6)
   goals met: 6 of 6
